# Ultralytics YOLO11-ConvNeXtV2-Pico
nc: 80 # number of classes
scales: # model compound scaling constants
  n: [1.00, 1.00, 1024] # 这里我们不需要缩放，直接写死 ConvNeXt 参数，或者为了兼容性留着但不起作用

backbone:
  # [from, repeats, module, args]
  # Stem: 4x downsampling, out_channels=64 (P2)
  - [-1, 1, ConvNeXtV2Stem, [64]]  # 0-P2/4

  # Stage 0: 2 blocks, keep channels 64
  - [-1, 2, ConvNeXtV2Block, [64]] # 1

  # Downsample: 2x, 64 -> 128 (P3)
  - [-1, 1, ConvNeXtV2Downsample, [128]] # 2-P3/8

  # Stage 1: 2 blocks, keep channels 128
  - [-1, 2, ConvNeXtV2Block, [128]] # 3

  # Downsample: 2x, 128 -> 256 (P4)
  - [-1, 1, ConvNeXtV2Downsample, [256]] # 4-P4/16

  # Stage 2: 6 blocks, keep channels 256
  - [-1, 6, ConvNeXtV2Block, [256]] # 5

  # Downsample: 2x, 256 -> 512 (P5)
  - [-1, 1, ConvNeXtV2Downsample, [512]] # 6-P5/32

  # Stage 3: 2 blocks, keep channels 512
  - [-1, 2, ConvNeXtV2Block, [512]] # 7

  # SPPF (Optional, keep for YOLO flavor)
  - [-1, 1, SPPF, [512, 5]] # 8

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # cat backbone P4 (index 5)
  - [-1, 2, C3k2, [256, False]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat backbone P3 (index 3)
  - [-1, 2, C3k2, [128, False]] # 14 (P3/8-small)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [256, False]] # 17 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 8], 1, Concat, [1]] # cat head P5 (index 8)
  - [-1, 2, C3k2, [512, True]] # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]] # Detect(P3, P4, P5)
